Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/boards.txt

menu.EraseFlash=* Erase Flash
menu.AutoUploadMode=* Auto Flash Mode
menu.UploadModeSelection=* Upload Mode
menu.UploadVideoBin=**      Video ISP Bin
menu.UploadNeuralNetworkBin=**      Neural Network Bin
menu.UploadNNOD=***      NN Models Object Detection
menu.UploadNNFD=***      NN Models Face Detection
menu.UploadNNFR=***      NN Models Face Recognition
menu.StdLibInit=* Standard Lib Enable

##############################################################
# PLEASE DO NOT PUT BOARDS ABOVE THE OFFICIAL AMEBA BOARDS! ##
##############################################################

Ameba_AMB82-MINI.name=AMB82-MINI
#Ameba_AMB82-MINI.vid.0=0x1A86
#Ameba_AMB82-MINI.pid.0=0x7523

Ameba_AMB82-MINI.upload.tool=ameba_pro2_tools
Ameba_AMB82-MINI.upload.protocol=usb_serial
Ameba_AMB82-MINI.upload.maximum_size=16777216
Ameba_AMB82-MINI.upload.use_1200bps_touch=false
Ameba_AMB82-MINI.upload.wait_for_upload_port=false
Ameba_AMB82-MINI.upload.native_usb=false

Ameba_AMB82-MINI.build.tarch=Arm-v8M
Ameba_AMB82-MINI.build.mcu=RTL8735B
Ameba_AMB82-MINI.build.f_cpu=500000000L
Ameba_AMB82-MINI.build.usb_product="AMB82-MINI"
Ameba_AMB82-MINI.build.board=AMEBA
Ameba_AMB82-MINI.build.core=ambpro2
#Ameba_AMB82-MINI.build.extra_flags=-DARDUINO_AMBPRO2 -DBOARD_AMB82_MINI {build.usb_flags}
Ameba_AMB82-MINI.build.ldscript=linker_scripts/gcc/amebapro2_ram_arduino.ld
Ameba_AMB82-MINI.build.variant=ameba_amb82-mini

Ameba_AMB82-MINI.menu.EraseFlash.Disable=Disable
Ameba_AMB82-MINI.menu.EraseFlash.Disable.build.erase_flash=Disable
Ameba_AMB82-MINI.menu.EraseFlash.Enable=Enable
Ameba_AMB82-MINI.menu.EraseFlash.Enable.build.erase_flash=Enable

Ameba_AMB82-MINI.menu.AutoUploadMode.Disable=Disable
Ameba_AMB82-MINI.menu.AutoUploadMode.Disable.build.auto_upload_mode=Disable
Ameba_AMB82-MINI.menu.AutoUploadMode.Enable=Enable
Ameba_AMB82-MINI.menu.AutoUploadMode.Enable.build.auto_upload_mode=Enable

Ameba_AMB82-MINI.menu.UploadModeSelection.NormalMode=Normal Mode
Ameba_AMB82-MINI.menu.UploadModeSelection.NormalMode.build.upload_mode=NormalEnable
Ameba_AMB82-MINI.menu.UploadModeSelection.SpeedMode=Speed Mode
Ameba_AMB82-MINI.menu.UploadModeSelection.SpeedMode.build.upload_mode=SpeedEnable

Ameba_AMB82-MINI.menu.UploadVideoBin.Yes=Yes
Ameba_AMB82-MINI.menu.UploadVideoBin.Yes.build.upload_mode_voe=VOEyes
Ameba_AMB82-MINI.menu.UploadVideoBin.No=No
Ameba_AMB82-MINI.menu.UploadVideoBin.No.build.upload_mode_voe=VOEno

Ameba_AMB82-MINI.menu.UploadNeuralNetworkBin.Yes=Yes
Ameba_AMB82-MINI.menu.UploadNeuralNetworkBin.Yes.build.upload_mode_nn=NNyes
Ameba_AMB82-MINI.menu.UploadNeuralNetworkBin.No=No
Ameba_AMB82-MINI.menu.UploadNeuralNetworkBin.No.build.upload_mode_nn=NNno

Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov4Tiny=Default Yolov4Tiny
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov4Tiny.build.nn_od_model=DYV4
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov4Tiny.build.nn_model_flags=-DMODEL_YOLOV4TINY
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov3Tiny=Default Yolov3Tiny
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov3Tiny.build.nn_od_model=DYV3
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov3Tiny.build.nn_model_flags=-DMODEL_YOLOV3TINY
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov7Tiny=Default Yolov7Tiny
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov7Tiny.build.nn_od_model=DYV7
Ameba_AMB82-MINI.menu.UploadNNOD.D_Yolov7Tiny.build.nn_model_flags=-DMODEL_YOLOV7TINY
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov4Tiny=Customize Yolov4Tiny
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov4Tiny.build.nn_od_model=CYV4
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov4Tiny.build.nn_model_flags=-DMODEL_YOLOV4TINY
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov3Tiny=Customize Yolov3Tiny
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov3Tiny.build.nn_od_model=CYV3
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov3Tiny.build.nn_model_flags=-DMODEL_YOLOV3TINY
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov7Tiny=Customize Yolov7Tiny
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov7Tiny.build.nn_od_model=CYV7
Ameba_AMB82-MINI.menu.UploadNNOD.C_Yolov7Tiny.build.nn_model_flags=-DMODEL_YOLOV7TINY
Ameba_AMB82-MINI.menu.UploadNNOD.NA=NA
Ameba_AMB82-MINI.menu.UploadNNOD.NA.build.nn_od_model=YVNo

Ameba_AMB82-MINI.menu.UploadNNFR.D_MobileFaceNet=Default MobileFaceNet
Ameba_AMB82-MINI.menu.UploadNNFR.D_MobileFaceNet.build.nn_fr_model=DM16
Ameba_AMB82-MINI.menu.UploadNNFR.C_MobileFaceNet=Customize MobileFaceNet
Ameba_AMB82-MINI.menu.UploadNNFR.C_MobileFaceNet.build.nn_fr_model=CM16
Ameba_AMB82-MINI.menu.UploadNNFR.NA=NA
Ameba_AMB82-MINI.menu.UploadNNFR.NA.build.nn_fr_model=MNo

Ameba_AMB82-MINI.menu.UploadNNFD.D_SCRFD=Default SCRFD
Ameba_AMB82-MINI.menu.UploadNNFD.D_SCRFD.build.nn_fd_model=DS64
Ameba_AMB82-MINI.menu.UploadNNFD.C_SCRFD=Customize SCRFD
Ameba_AMB82-MINI.menu.UploadNNFD.C_SCRFD.build.nn_fd_model=CS64
Ameba_AMB82-MINI.menu.UploadNNFD.NA=NA
Ameba_AMB82-MINI.menu.UploadNNFD.NA.build.nn_fd_model=SNo

Ameba_AMB82-MINI.menu.StdLibInit.Disable=NA
Ameba_AMB82-MINI.menu.StdLibInit.Disable.build.extra_flags=-DARDUINO_SDK -DARDUINO_AMBPRO2 -DBOARD_AMB82_MINI {build.usb_flags} {build.nn_model_flags}
Ameba_AMB82-MINI.menu.StdLibInit.Enable=Arduino_STD_PRINTF
Ameba_AMB82-MINI.menu.StdLibInit.Enable.build.extra_flags=-DARDUINO_SDK -DARDUINO_AMBPRO2 -DBOARD_AMB82_MINI {build.usb_flags} -DArduino_STD_PRINTF {build.nn_model_flags}

##############################################################
